app/views/reports/index.html.erb

        <div class="col-sm-2">
          <%= f.collection_select :category_id, Category.all.order(:name), :id, :name, class: "form-control", prompt: " " %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC